{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Judson",
    "url": "http://sleepyhead.org/",
    "photo": "https://www.gravatar.com/avatar/f43a13a5d14284e348311261d1e7dffc?s=256&d=404"
  },
  "url": "http://sleepyhead.org/",
  "published": "2008-10-21T19:22:00-07:00",
  "content": {
    "html": "First, let me say I am a gay person, and my \"ideal scenario\" is exactly the same as yours. I see no reason to have governments involved in marriage whatsoever. If for no other reason than that, I would oppose prop 8, as it codifies marriage in the state constitution.\r\n\r\nFurther than that though, it codifies segregation, and intolerance in a way that I can't support, and which has real impact on people. It may seem like a completely objective calculation to you, but when you're 15 years old, realizing you're gay, and your state passes a law saying you will never be normal, and never be allowed to marry it hurts. That person is out there. Thousands of them. To a lesser extent it hurts many more people. Many people look to \"tolerant\" parts of the country for hope, for the idea that maybe one day these ideas will spread, and we will be accepted everywhere. This crushes those dreams.\r\n\r\nTo address some of your specific points:\r\n\r\n\"If instead Proposition 8 does pass, then at the very least it protects the traditional religious definition of marriage\"\r\n\r\nWhy should religious definitions be protected in the secular constitution?\r\n\r\n\"Over time, additional legislation could seek the removal of marriage from state law, to be replaced by domestic partnerships (or civil unions) for both same-sex and opposite-sex couples.\"\r\n\r\nIt could, but what are the chances in that? Do you think a bill to remove marriage would be popular? Christian groups frame prop 8 failing (meaning no changes to the current situation) as somehow an attack on marriage. The idea that an actual prop or bill to actually remove marriage would be feasible is wishful thinking.",
    "text": ""
  },
  "wm-id": "25819",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}