{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Will Norris",
    "url": "http://willnorris.com",
    "photo": "https://www.gravatar.com/avatar/2025929025b4492c58961f28cc4ed93d?s=256&d=404"
  },
  "url": "http://willnorris.com",
  "published": "2007-02-22T16:19:12-08:00",
  "content": {
    "html": "<blockquote cite=\"#comment-1306\">It is for authorize user to override information for current comment.  <i>- Yann Lugrin</i></blockquote>\r\n\r\n<p>I'm certainly open to suggestions, but I'm a little concerned with where you may be going with this.  OpenID is primarily a method of federating authentication and allowing for presentation of a consistent identity among different systems or applications.  Many OpenID providers do support the idea of multiple \"personas\" to represent the fact that people often play many different roles in the real world and therefore their identity may be defined by the context within which it is presented.  For example, I may use my formal name when I'm at work, but a nickname and perhaps different email address when I'm outside of work.  I'm still the same person, but I'm in a different context so I present myself differently.  It's important to note however, that my persona typically does not change within a given context, but rather when moving between contexts.  The question then arises, and I guess maybe this is what you're getting to, what if I want to present multiple personas simultaneously within a given context?  Perhaps that wouldn't actually be multiple personas, but rather a third \"combined\" persona... I'm not sure.  These are much deeper questions than I feel qualified to address, but I'm sure (or at least hope) they are being discussed by people much smarter than me.</p>\r\n\r\n<p>Now I could be wrong on all that, and this kind of a feature may be in line with the philosophy of OpenID... I'm not sure, but I'd love to hear more discussion on the topic.</p>\r\n\r\n<p>As a side note, my understanding is that there is work going into OpendID 2.0 to include some privacy preserving features (perhaps akin to SAML Persistent ID ? -- cf section 8.3.7 of <a href=\"http://docs.oasis-open.org/security/saml/v2.0/saml-core-2.0-os.pdf\">saml-core-2.0-os.pdf</a>), so it will be interesting to see what kind of effect that has on this issue.</p>\r\n",
    "text": ""
  },
  "wm-id": "1309",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2007/02/new-wpopenid-r13/"
}
