{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "hillary hartley",
    "url": "http://quepol.myopenid.com/",
    "photo": "https://www.gravatar.com/avatar/c59c3bd997ef214eb8fed558af3c459d?d=404"
  },
  "url": "http://quepol.myopenid.com/",
  "published": "2008-10-21T21:32:15-07:00",
  "content": {
    "html": "While I am absolutely biased and cannot pretend otherwise (http://tr.im/give5), I'm inclined to agree with Brynn, Mark, and others (if I've understood them correctly) when it comes to getting closer to your personal ideal.\r\n\r\nIf Proposition 8 passes, I think the \"right\" will feel vindicated -- if they can pass this kind of Constitutional amendment in California, then surely it's possible anywhere.  We'll continue to see states writing discrimination *into* their constitutions instead of *out of* them, and marriage will be more and more entrenched in the politics of the state.\r\n\r\nIf 50%+1 of Californians can write this kind of discrimination into the Constitution, what is next?  Amending the Constitution should be a big deal.  Why should 50%+1 of the people get to do what it takes 66% of our elected officials to accomplish.  As I said, I'm biased, but I'd like to think that even if I wasn't gay and legally married I would vote NO.  Consider this my pledge to vote NO on future Constitutional amendments brought to the ballot and not by the legislature -- unless the ratification process is changed.\r\n\r\nIf Prop 8 fails, and more states legislate \"in favor of gay marriage,\" I think that may actually get you closer to your ideal.  At a certain point, the \"right\" will have to choose their battles.\r\n[quote comment=\"25821\"]Unfortunately not many people like us are pushing to have the concept of marriage separated from the concept of a civil union.  But consider: this might be a back door to getting the \"one-man-one-woman-mandated-by-law\" folks on board with that separation. They're fond of using the \"the gays are peeing in our marriage pool\" argument. Let's use it to our favor. We can sell it as a way of making marriage a personal/religious institution, completely up to your personal beliefs. Their main goal is to not have the State recognize homosexual unions as \"marriage.\" I think having the State also cease calling their unions \"marriage\" would be an acceptable cost.[/quote]\r\n\r\nThanks for your honesty and sincerity.  Now for some of my own:  I hope you'll choose equality.  Tell the state to recognize my marriage the same way it recognizes your's.\r\n\r\nHillary\r\nlegally married since 6/18/08\r\nin love since 2001\r\nfriends since 1993",
    "text": ""
  },
  "wm-id": "25825",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}