{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Mark Jaquith",
    "url": "http://markjaquith.com/",
    "photo": "https://www.gravatar.com/avatar/e4bc488b0e3c6549e2d6349a9eb3e3b8?s=256&d=404"
  },
  "url": "http://markjaquith.com/",
  "published": "2008-10-21T19:52:10-07:00",
  "content": {
    "html": "<blockquote>I do not, however, believe that any one sin is fundamentally worse than another.</blockquote>\r\n\r\nJesus would disagree with you. He said to Pilate:\r\n\r\n<blockquote>Jesus answered, \"You would have no power over me if it were not given to you from above. Therefore the one who handed me over to you is guilty of a greater sin.\"</blockquote>\r\n\r\nSo yes, in one sense we're all sinners, and it's not for us to cast judgement. But in the eyes of God, there are greater and lesser sins. But that's a tangent. I believe in rendering to Caesar what is Caesar's and to God what is God's -- that is, I believe in separation of Church and State, and I'm comfortable pushing for things like legalized drugs, legalized prostitution, etc, even though I may have moral or religious objections to them. Freedom and human rights are worth the price.\r\n\r\n<blockquote>Being a religious institution, I believe marriage has no place in government, either in being defined or performed. If governments wish to offer various rights and benefits to legally recognized family units, those rights should be equally extended without any kind of discrimination, whether based on age, race, sexual orientation, etc. I believe government should be involved only in the business of performing such civil unions, seperate from the institution of marriage.</blockquote>\r\n\r\nAbsolutely. As a libertarian (and as a Christian), I detest the idea that I have to have permission from the state for my marriage to be recognized by anyone.\r\n\r\nI'm with Chris: as long as the State is interfering with marriage, it should interfere equally. Unfortunately not many people like us are pushing to have the concept of marriage separated from the concept of a civil union.  But consider: this might be a back door to getting the \"one-man-one-woman-mandated-by-law\" folks on board with that separation. They're fond of using the \"the gays are peeing in our marriage pool\" argument. Let's use it to our favor. We can sell it as a way of making marriage a personal/religious institution, completely up to your personal beliefs. Their main goal is to not have the State recognize homosexual unions as \"marriage.\" I think having the State also cease calling their unions \"marriage\" would be an acceptable cost.\r\n\r\nI use this line of reasoning to sell that point:\r\n\r\n\"If you found out that your Best Man forgot to file your marriage license and that you weren't actually legally married, would you consider your marriage null and void?\" (Rhetorical question, answer for them: \"Of course not! Your marriage doesn't depend on recognition from the State... it was sealed with your vows!\").\r\n\r\nIn Florida, I have a much easier choice to make. We have \"Amendment 2\" here, which seeks to write banning of both homosexual marriage and homosexual civil unions into our State Constitution. They're not even currently legal! It seeks to write discrimination into our Constitution, which makes me furious.",
    "text": ""
  },
  "wm-id": "25821",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}