{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Kellie",
    "url": "",
    "photo": "https://www.gravatar.com/avatar/8459a3bf20944f569b38738697034974?d=404"
  },
  "url": "",
  "published": "2008-10-21T22:34:06-07:00",
  "content": {
    "html": "I agree with your ideal as well. I think this is where the \"right\" gets tripped up wrt marriage issues. There's marriage as a civil, legal contract between two people, and then there's marriage as a religious union performed in and/or recognized by a church. They should be two separate things. But, I think that as a society, the train has already left the station on that one. I'm not sure we can untangle it now.\r\n\r\nBut because we're talking about the state constitution and law, we can only really look at the governmental (civil) and legal angle. And I agree with what others have said... if the government is going to interfere, it should interfere equally.\r\n\r\nI also wanted to address your thoughts re: domestic partnership. This was actually the basis of the CA supreme court ruling that made same-sex marriage equal this past spring. It basically boils down to \"separate but equal is not equal\". Because the rights under CA's domestic partnership law equalled that of the rights given by the state under its marriage law, the court held that the separation of the two, including the alternate name, was unconstitutional. Because it's the same thing, you can't call it something different for a subset of citizens. It may be true  that the domestic partnership law stays intact if Prop 8 passes, but it puts people right back into that \"separate but equal\" bucket. It also enshrines discrimination into the state constitution. I believe that it's wrong to take away rights from people.\r\n\r\nIn the spirit of full disclosure, I am a lesbian. I entered into a domestic partnership in 2006, and I was legally married to my wife in 2008. My family (Methodist Republicans from Alabama) and my wife's family (Mormon Republicans from Missouri) both celebrate, love, and support us. They don't treat us any differently than their straight children. They all think we should have the right to marry. My mom is fond of saying that Dolly Parton had it right -- \"they have a right to be just as miserable as the rest of us\".\r\n\r\nThank you for your thoughtful analysis and being willing to listen to all sides. Regardless of how you decide to vote, I respect your decision because you took the time to examine all sides of the issue. Too many people don't do that. That said, I'm voting No on 8, and I hope you'll join me.",
    "text": ""
  },
  "wm-id": "25827",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}