{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Jilles van Gurp",
    "url": "http://www.jillesvangurp.com/",
    "photo": "https://www.gravatar.com/avatar/d4bba89347dad67c8de96a876b93c5aa?d=404"
  },
  "url": "http://www.jillesvangurp.com/",
  "published": "2008-10-21T18:28:21-07:00",
  "content": {
    "html": "Being Dutch, an atheist, and the brother of a lesbian &amp; married sister, I'm hardly objective. Part of what makes this issue easy in the Netherlands is that the state marriage has long been separate from church marriage (which is entirely optional and not legally binding). In fact, a church marriage is illegal without a state marriage (essentially a form of tax evasion). A state marriage is done by a civil servant, a church marriage typically by a priest, vicar or other church representative. They're two different things. Gay marriage in the Netherlands merely extends rights (e.g. inheritance) &amp; benefits associated with state marriage to same sex unions.\r\n\r\nYour believes are of course very personal and should be respected. I just hope you extend the same courtesy to other people. So, the real question is whether you believe your believes should be imposed on others, even if they don't share your believes? This is essentially what this is about. \r\n\r\nYou are trying to use the constitution to restrict other people's freedom regarding this. You need to change it to do that. The constitution is the way it is precisely because the people who wrote it believed that separation of state and church was a good thing and that people should not be imposing their believes on others through it.\r\n\r\nBasically, you are telling people like my sister that she can't do what she has done because of something you believe. Quite something to tell somebody something like that. Who gave you that right? Imagine telling it to her face instead of checking a box on some form next month. If that doesn't help, reverse the situation in your mind and imagine being told you can't do something because of what somebody else believes. Like, for example, practicing your religion in a place like Iran or China where they have a constitution that basically makes this illegal.\r\n\r\nIt's as simple as that, regardless of what you believe.",
    "text": ""
  },
  "wm-id": "25816",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}