{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Brynn Evans",
    "url": "http://brynnevans.com/",
    "photo": "https://www.gravatar.com/avatar/785bf18615176132ed90d817846d5348?s=256&d=404"
  },
  "url": "http://brynnevans.com/",
  "published": "2008-10-21T17:54:18-07:00",
  "content": {
    "html": "You wrote that: \"Chris immediately jumps to the conclusion that if marriage must exist, then it should be non-discriminatory.\"\r\n\r\nIt's not that Chris (and I) believe marriage should be non-discriminatory, but rather that legislation should be non-discriminatory. If marriage as a religious institution only recognizes unions between a man and a woman, that's fine. And we both agree that this should be returned to the domain of the church. However, I believe that laws should afford equal rights to everyone (regardless of the issue), and I view Proposition 8 as a strong threat to this.\r\n\r\nI do understand your dilemma, and I applaud you for really thinking about this issue. In fact, you've highlighted some points that I hadn't thought of before either. But to your final thoughts: I'm not convinced that *not* passing Prop 8 will remove any further effort to disentangle marriage from government. We continue to propose new laws and modifications to the legislature all the time--why would this case be any different? \r\n\r\nOn the other hand, if Prop 8 does pass, I'm not convinced that there will continue to be a push to support domestic partnerships. I worry that people will feel the law has decided it, once and for all, and become complacent. Or minimally, if it passes, it will be incredibly hard to repeal.\r\n\r\nFurthermore, if Prop 8 does pass, it sets a terrible precedent. First, it will enforce marriage within the real of government. Second, when other states propose similar amendments, they can look to CA (and Florida apparently, too) as a model. And this model will be one of inherent discrimination. \r\n\r\nIf I were to really try to argue my point, I would say: given your belief in the sanctity of marriage and your other desire to support equality, a Yes vote on Prop 8 is more likely to keep marriage within the domain of government and enforce discrimination--both unfortunate given your leanings. A No vote on Prop 8 will 1) encourage non-discrimination in the legislature (a win) and 2) grant same-sex couples \"marriage\" rights (maybe not a win for you). I think it's also more likely that a No vote will broaden discussion of where the institution of marriage should lie, so that further down the line we can disentangle marriage from government and restore the sanctity of marriage to the church. Either way, I see no real win with a Yes vote, but at least a tradeoff (for you) with a No vote. \r\n\r\nI'd love to continue the conversation offline!",
    "text": ""
  },
  "wm-id": "25814",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}