{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Tony",
    "url": "",
    "photo": "https://www.gravatar.com/avatar/023ffb1312c1f4db72cd7f9de3379d8a?s=256&d=404"
  },
  "url": "",
  "published": "2008-10-22T07:15:02-07:00",
  "content": {
    "html": "I though I would try and take a different tack on this and look at the biblical basis for this belief. \r\n\r\nIt's always dangerous for an atheist to trade scripture with a committed christian but hey ho.\r\n\r\nI have questions about the church's pix-and--mix attitude to enforcing the 'homosexuality is an abomination' line. The principal passages that deal with homosexuality in the Bible are Leviticus and the writings of Paul. \r\n\r\nI think we can safely assume that the church has taken a somewhat relaxed attitude to most of the abominations in Leviticus. Hence the prawn cocktails and cotton-polyester cassocks at my local church. These abominations face the same penalty as homosexuality and yet are relaxed. \r\n\r\nLikewise with the writings of Paul in Corinthians and Romans he refers to homosexuality as an abomination. However, he also gives the same penalty to women with short hair and men with long.\r\n\r\nThis for me is the problem of the church. If the church is deciding to stand firm on some abominations but laughing others off when the biblical strictures are the same, we can say that the position on homosexuality is not based upon the bible but instead some later prejudice.\r\n\r\nOne might reference Sodom and Gomorrah, though I think using the mass gang rape of two tourists as the basis for denying a committed consensual relationship between two people is rather spurious.\r\n\r\nEven post-bible, the church's relationship with homosexuality has been variable. The early Roman church used to punish monks for homosexuality, but the punishment was equivalent to missing curfew. Hardly the grave sin it is now seen as.\r\n\r\nGiven the fact that more than 40 species have been recorded as engaging in homosexual activity, I find it hard to believe that God would find homosexuality an abomination for humans but ok for seagulls.\r\n\r\nFor me, I'd go with Emerson. To think that God can be pinned down, unchanging in the pages of a book or by the words of mortal men, is to kill God and make him pointless. Instead, a direct communion based upon observation of the world and true morality is the closest way to touch god.\r\n\r\nbut that's just my opinion :)\r\n\r\nGreat book on homosexuality and the church if you fancy it: <a href=\"http://www.amazon.com/Church-War-Anglicans-Homosexuality/dp/1850434808/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1224658470&amp;sr=8-1\">A Church at War: Anglicans and Homosexuality</a>",
    "text": ""
  },
  "wm-id": "25834",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}