{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Gerv",
    "url": "",
    "photo": "https://www.gravatar.com/avatar/3974f4c1e996748fa3a9f3d7be45259c?d=404"
  },
  "url": "",
  "published": "2008-10-26T21:35:52-07:00",
  "content": {
    "html": "Will,\r\n\r\nIt's great that you started with your four presuppositions, because it's really easy to see where you are coming from. And if they were all correct, then your argument may well hold. But I want to take issue with a couple of them :-)\r\n\r\n<blockquote>\r\nIn general, I do not believe that you can legislate morality.\r\n</blockquote>\r\n\r\nThat may be so. But it does not therefore follow that morality should not be reflected in legislation. God seemed entirely happy to have morality reflected in legislation during the time of the Old Testament. But that brings us on to the question of \"the separation of church and state\", as it's normally called. \r\n\r\nMy points on this question are these: firstly, a lot of American Christians (and I'm not saying you are one, although leading off your justification for the church's witness with the First Amendment is a bad sign) seem to look to the US Constitution first and the Bible second to see how a country should be governed. \r\n\r\nSecondly, the relevant clause in the Constitution says two things: 1) no established church (like the Church of England in the UK) - \"establish\" was a technical term at the time - and 2) no-one should be prevented from freely exercising their religion. It doesn't say anything like \"Anything the federal government or any of its agencies, appointees etc. does should have nothing to do with God.\" \r\n\r\n(I realise there are Constitutional interpretative minimalists, who take it to mean what it says, and maximalists, who take it to mean whatever they'd like it to mean which is vaguely related. My description of the two positions makes it fairly clear with whom I have most sympathy. And I don't think Christians should buy into the maximalism.)\r\n\r\nThirdly, almost everyone seems to quote the story of Jesus and the coin with Caesar's head on it as being Jesus' endorsement of the principle of separation of church and state in exactly the way the person concerned defines such a separation. Yet careful exegesis seems curiously lacking. \r\n\r\nIt seems to me that the clear message of the parable is: Caesar has a claim on your money - a piffling trifle in the grand scheme of things - but God has a claim on your entire life. (And you Pharisees and Herodians who think you can trick me need to pay attention to that.) There is no \"two kingdoms\" theology here.\r\n\r\nHaving said all that then, I think that the premise of your fourth point is flawed. There is no way you can divide the world like \"This is the way we run things when God is involved, which is 'discriminatory', and this is the way we run things when God isn't involved, which is fair to everyone\". What exactly does that sort of view say about God? \r\n\r\nJesus is Lord of all, or he's not Lord at all. There is not one single square inch of the universe over which he does not cry \"Mine!\". And that includes the civil government and all the members thereof, and it includes the laws that they should write. The fact that not everyone agrees with this, and some seriously disagree, doesn't make it not true.",
    "text": ""
  },
  "wm-id": "25922",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}