{
  "type": "entry",
  "author": {
    "type": "card",
    "name": "Michelle",
    "url": "",
    "photo": "https://www.gravatar.com/avatar/d930b4bde70d34a0084c769071ab6fdb?d=404"
  },
  "url": "",
  "published": "2008-10-24T16:53:52-07:00",
  "content": {
    "html": "Great discussion on your blog.  You know, you and your brother never cease to amaze me in how you make me think about things! =)\r\n\r\nHere are my issues.\r\n\r\n  1. I don't think that Government should define marriage.  I think that  is treading on dangerous territory.\r\n\r\n  2.  It is discrimination to say that you can't marry due to your particular sex practices.  (What is next, you can't marry if you  don't have sex in the missionary position?!)\r\n\r\n  3. I agree that I believe homosexuality is a sin, but why is it that  christians harp on this one so much.  The Bible talks a whole lot more on divorce and yet our churches are full of divorcees.\r\n\r\n  4. Lastly, I think that it comes down to a violation of civil rights  and humanity when you deny a person what most of us consider the right to live.  (Of course this is highly influenced by my view that all people, disabled included, are human beings and should be afforded the same rights to life, liberty, and the pursuit of  happiness.)  It is not right to tell a gay couple that is committed  to each other that they can't visit in the hospital if their loved one is sick or that they  don't have any legal rights, or that after their partner dies they  are entitled to nothing.\r\n\r\nI think that Christ loves everyone equally.  By putting that kind of  language in the constitution  you are stating that the rest of us \"sinners\" are entitled to more human rights than \"those\" sinners.  No one would think of  immpossing the same kind of law for an addict, or an adulterer, or a  lier.\r\n\r\nFrom 1850 to 1977, California's marriage statutes used gender-neutral language, without reference to \"man\" or \"woman,\" in  providing that marriage is a personal relation arising out of a  \r\n civil contract to which the consent of the parties capable of making  the contract is necessary.\r\n\r\nTo me the above is as far as the government should go.  Beyond that  and it should be up to the churches to decide.",
    "text": ""
  },
  "wm-id": "25877",
  "wm-property": "in-reply-to",
  "in-reply-to": "https://willnorris.com/2008/10/thoughts-on-proposition-8/"
}