autoconf
browser
coreutils
dos2unix
duff
gettext
go
grc
libevent
lynx
makedepend
mercurial
nginx
openssl
pcre
pkg-config
pngcrush
rbenv
ruby-build
tmux
vim
wget
zsh-completions
zsh-lovers
